## generate_sbom
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                              |
|--------|---------------------------------------------------------------|
| add    | `aws_ecr_lifecycle_policy.generate_sbom_trivy_db`             |
|        | `aws_ecr_lifecycle_policy.generate_sbom_trivy_java_db`        |
|        | `aws_ecrpublic_repository.generate_sbom_trivy_java_db`        |
|        | `aws_ecrpublic_repository_policy.generate_sbom_trivy_java_db` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.generate_sbom_trivy_db will be created
  + resource "aws_ecr_lifecycle_policy" "generate_sbom_trivy_db" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "security-tools/generate_sbom/trivy-db"
    }

  # aws_ecr_lifecycle_policy.generate_sbom_trivy_java_db will be created
  + resource "aws_ecr_lifecycle_policy" "generate_sbom_trivy_java_db" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "security-tools/generate_sbom/trivy-java-db"
    }

  # aws_ecrpublic_repository.generate_sbom_public has moved to aws_ecrpublic_repository.generate_sbom_trivy_db
    resource "aws_ecrpublic_repository" "generate_sbom_trivy_db" {
        id              = "security-tools/generate_sbom/trivy-db"
        tags            = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-generate_sbom"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecrpublic_repository.generate_sbom_trivy_java_db will be created
  + resource "aws_ecrpublic_repository" "generate_sbom_trivy_java_db" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + registry_id     = (known after apply)
      + repository_name = "security-tools/generate_sbom/trivy-java-db"
      + repository_uri  = (known after apply)
      + tags            = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-generate_sbom"
          + "Terraform"  = "true"
        }
      + tags_all        = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-generate_sbom"
          + "Terraform"  = "true"
        }
    }

  # aws_ecrpublic_repository_policy.sbom_public_policy has moved to aws_ecrpublic_repository_policy.generate_sbom_trivy_db
    resource "aws_ecrpublic_repository_policy" "generate_sbom_trivy_db" {
        id              = "security-tools/generate_sbom/trivy-db"
        # (3 unchanged attributes hidden)
    }

  # aws_ecrpublic_repository_policy.generate_sbom_trivy_java_db will be created
  + resource "aws_ecrpublic_repository_policy" "generate_sbom_trivy_java_db" {
      + id              = (known after apply)
      + policy          = (sensitive)
      + registry_id     = (known after apply)
      + repository_name = "security-tools/generate_sbom/trivy-java-db"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
